# Data Mining 1, Exam 2, Quetion 5
20160819 Ron Neely
Clean Data for Neural Net

Steps:
1. Load data
2. Normalize data
3. Make dummies
4. Save normalized data

In [1]:
import numpy as np
import pandas as pd
import sys
print(sys.version)

3.6.6 |Anaconda custom (64-bit)| (default, Jun 28 2018, 11:27:44) [MSC v.1900 64 bit (AMD64)]

## 1. Load data

In [2]:
df = pd.read_csv("exam2raw.csv")
print(df.shape)
print(df.dtypes)
df.head(2)

(11, 5)
Record     int64
Job       object
Gender    object
Age        int64
Salary     int64
dtype: object

   Record      Job Gender  Age  Salary
0       1  Service      F   45      48
1       2  Service      M   25      25

set index and make lower case (personal preference)

In [3]:
df['record'] = df.Record
df.set_index('record', drop=True, inplace=True)
df.drop(['Record'], axis=1, inplace=True)
df = df.applymap (lambda s: s.lower() if type(s) == str else s)
df.head(2)

            Job Gender  Age  Salary
record
1       service      f   45      48
2       service      m   25      25

## 2. Normalize data

normalize age and salary via min/max normalization

In [4]:
df['age'] = df.Age.map(lambda v: (v - df.Age.min()) / (df.Age.max() - df.Age.min()))
df['salary'] = df.Salary.map(lambda v: (v - df.Salary.min()) / (df.Salary.max() - df.Salary.min()))
df.drop(['Age','Salary'], axis=1, inplace=True)
df.head(2)

            Job Gender  age    salary
record
1       service      f  0.8  0.511111
2       service      m  0.0  0.000000

gender is female or not - make it so

In [5]:
df['gender_female'] = df.Gender.map(lambda v: 1 if v == 'f' else 0)
df.drop(['Gender'], axis=1, inplace=True)
df.head(2)

            Job  age    salary  gender_female
record
1       service  0.8  0.511111              1
2       service  0.0  0.000000              0

## 3. Make dummies

In [6]:
df['job'] = df.Job
df.drop(['Job'], axis=1, inplace=True)
df = pd.get_dummies(df)
df

,age,salary,gender_female,job_management,job_sales,job_service,job_staff
record,,,,,,,
1,0.80,0.511111,1,0,0,1,0
2,0.00,0.000000,0,0,0,1,0
3,0.32,0.222222,0,0,0,1,0
4,0.00,0.444444,0,1,0,0,0
5,0.40,0.888889,1,1,0,0,0
6,0.04,0.444444,0,1,0,0,0
7,0.80,1.000000,1,1,0,0,0
8,0.60,0.555556,1,0,1,0,0
9,0.20,0.333333,0,0,1,0,0
10,1.00,0.333333,1,0,0,0,1
11,0.00,0.000000,0,0,0,0,1

## 4. Save normalized data

In [7]:
df.to_csv("exam2clean.csv", index_label='record')